# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

# Пример:

# - 6 -> да
# - 7 -> да
# - 1 -> нет

week_day = int(input('Input day of week: '))

if week_day == 1:
    print('Нет')
elif week_day == 2:
    print('Нет')
elif week_day == 3:
    print('Нет')
elif week_day == 4:
    print('Нет')
elif week_day == 5:
    print('Нет')
else:
    print('Да')

